app/views/carts/_cart.html.erb

SELECT  1 AS one FROM "line_items"  WHERE "line_items"."cart_id" = ? LIMIT 1  [["cart_id", 55]]
SELECT "line_items".* FROM "line_items"  WHERE "line_items"."cart_id" = ?  [["cart_id", 51]]
---
<!--<% unless cart.line_items.empty? %> -->