app/controllers/admin_controller.rb

SELECT COUNT(*) FROM "orders"
---
  def index
  	@tatal_orders = Order.count