app/controllers/line_items_controller.rb

SELECT  "products".* FROM "products"  WHERE "products"."id" = ? LIMIT 1  [["id", 16]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2014-08-09 01:52:48.341519"], ["updated_at", "2014-08-09 01:52:48.341519"]]
INSERT INTO "line_items" ("cart_id", "created_at", "product_id", "updated_at") VALUES (?, ?, ?, ?)  [["cart_id", 21], ["created_at", "2014-08-09 02:32:05.078062"], ["product_id", 16], ["updated_at", "2014-08-09 02:32:05.078062"]]
UPDATE "line_items" SET "quantity" = ?, "updated_at" = ? WHERE "line_items"."id" = 11  [["quantity", 2], ["updated_at", "2014-08-09 06:22:56.517109"]]
---
  def create
    @cart  =  current_cart
    product = Product.find(params[:product_id])
    #@line_item  =  @cart.line_items.build(:product =>  product)
    @line_item = @cart.add_product(product.id)
    #@line_item = LineItem.new(line_item_params)

    respond_to do |format|
      if @line_item.save

DELETE FROM "line_items" WHERE "line_items"."id" = ?  [["id", 980190962]]
---
  def destroy
    @line_item.destroy