app/controllers/orders_controller.rb

  def new
    @cart = current_cart
    if @cart.line_items.empty?
---
SELECT  1 AS one FROM "line_items"  WHERE "line_items"."cart_id" = ? LIMIT 1  [["cart_id", 59]]
SELECT "line_items".* FROM "line_items"  WHERE "line_items"."cart_id" = ?  [["cart_id", 59]]

  def create
    @order = Order.new(order_params)
    @order.add_line_items_form_cart(current_cart)

    respond_to do |format|
      if @order.save
---
INSERT INTO "orders" ("address", "created_at", "email", "name", "pay_type", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["address", "MyText"], ["created_at", "2014-08-19 01:20:30.716829"], ["email", "MyString"], ["name", "MyString"], ["pay_type", "MyString"], ["updated_at", "2014-08-19 01:20:30.716829"]]