app/controllers/products_controller.rb

INSERT INTO "products" ("created_at", "description", "image_url", "price", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2014-08-07 06:09:20.421836"], ["description", "s"], ["image_url", "s"], ["price", 0.0], ["title", "s"], ["updated_at", "2014-08-07 06:09:20.421836"]]
---
	def create
		params.permit!
		@product  = Product.new(product_params)

		@product.save

SELECT  "products".* FROM "products"  WHERE "products"."id" = ? LIMIT 1  [["id", 15]]
UPDATE "products" SET "description" = ?, "image_url" = ?, "price" = ?, "title" = ?, "updated_at" = ? WHERE "products"."id" = 980190962  [["description", "Wibbles are fun"], ["image_url", "Lorem.jpg"], ["price", 19.95], ["title", "Lorem Ipsum"], ["updated_at", "2014-07-28 09:08:32.810276"]]
---
	def update
		@product = Product.find(params[:id])

		if @product.update(product_params)